w200024212/pebbleos/src/fw/drivers/nrf5/qspi.c
#include "drivers/qspi.h"
#include "drivers/qspi_definitions.h"

#include "drivers/flash/qspi_flash.h"
#include "drivers/flash/qspi_flash_definitions.h"

#include "board/board.h"
#include "drivers/dma.h"
#include "drivers/flash/flash_impl.h"
#include "drivers/gpio.h"
#include "drivers/periph_config.h"
#include "flash_region/flash_region.h"
#include "kernel/util/delay.h"
#include "kernel/util/sleep.h"
#include "kernel/util/stop.h"
#include "mcu/cache.h"
#include "system/logging.h"
#include "system/passert.h"
#include "util/math.h"

#define NRF5_COMPATIBLE
#include <mcu.h>

#include "FreeRTOS.h"
#include "semphr.h"

#include <nrfx_qspi.h>

/* nRF5's QSPI controller is different enough from STM32's that we
 * reimplement qspi_flash.c, not stm32/qspi.c.  */

//! Address value which signifies no address being sent
#define QSPI_ADDR_NO_ADDR (UINT32_MAX)
//! Word size for DMA reads
#define QSPI_DMA_READ_WORD_SIZE (4)


static void prv_use(QSPIPort *dev) {
  dev->state->use_count++;
}

static void prv_release(QSPIPort *dev) {
  PBL_ASSERTN(dev->state->use_count > 0);
}

status_t flash_impl_set_nvram_erase_status(bool is_subsector,
                                           FlashAddress addr) {
  return S_SUCCESS;
}

status_t flash_impl_clear_nvram_erase_status(void) {
  return S_SUCCESS;
}

status_t flash_impl_get_nvram_erase_status(bool *is_subsector,
                                           FlashAddress *addr) {
  // XXX
  return S_FALSE;
}

#define FLASH_RESET_WORD_VALUE (0xffffffff)

static void prv_read_register(QSPIPort *dev, uint8_t instruction, uint8_t *data, uint32_t length) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(instruction, length + 1);
  instr.io2_level = 1;
  instr.io3_level = 1;
  nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, NULL, data);
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static void prv_write_cmd_no_addr(QSPIPort *dev, uint8_t cmd) {
  nrf_qspi_cinstr_conf_t instr = NRFX_QSPI_DEFAULT_CINSTR(cmd, 1);
  instr.io2_level = 1;
  instr.io3_level = 1;
  nrfx_err_t err = nrfx_qspi_cinstr_xfer(&instr, NULL, NULL);
  PBL_ASSERTN(err == NRFX_SUCCESS);
}

static bool prv_poll_bit(QSPIPort *dev, uint8_t instruction, uint8_t bit_mask, bool should_be_set,
                   uint32_t timeout_us) {
  uint32_t loops = 0;
  uint8_t val;
  while (1) {
    prv_read_register(dev, instruction, &val, 1);
    if ((!!(val & bit_mask)) == should_be_set)
      break;
    if ((timeout_us != QSPI_NO_TIMEOUT) && (++loops > timeout_us)) {
      PBL_LOG(LOG_LEVEL_ERROR, "Timeout waiting for a bit!?!?");
      return false;
    }
    delay_us(1);
  }

  return true;
}

static void prv_write_enable(QSPIFlash *dev) {
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.write_enable);
  // wait for writing to be enabled
  prv_poll_bit(dev->qspi, dev->state->part->instructions.read_status,
                dev->state->part->status_bit_masks.write_enable, true /* set */, QSPI_NO_TIMEOUT);
}

static bool prv_check_whoami(QSPIFlash *dev) {
  // The WHOAMI is 3 bytes
  const uint32_t whoami_length = 3;
  uint32_t read_whoami = 0;
  prv_read_register(dev->qspi, dev->state->part->instructions.qspi_id, (uint8_t *)&read_whoami,
                    whoami_length);

  if (read_whoami == dev->state->part->qspi_id_value) {
    PBL_LOG(LOG_LEVEL_INFO, "Flash is %s", dev->state->part->name);
    return true;
  } else {
    PBL_LOG(LOG_LEVEL_ERROR, "Flash isn't expected %s (whoami: 0x%"PRIx32")",
            dev->state->part->name, read_whoami);
    return false;
  }
}

bool qspi_flash_check_whoami(QSPIFlash *dev) {
  prv_use(dev->qspi);
  bool result = prv_check_whoami(dev);
  prv_release(dev->qspi);
  return result;
}

bool qspi_flash_is_in_coredump_mode(QSPIFlash *dev) {
  return dev->state->coredump_mode;
}

static void _flash_handler(nrfx_qspi_evt_t event, void *ctx) {
  QSPIFlash *dev = (QSPIFlash *)ctx;
  PBL_ASSERTN(event == NRFX_QSPI_EVENT_DONE);
  dev->qspi->state->waiting = 0;
  if (!dev->state->coredump_mode) {
    BaseType_t woken = pdFALSE;
    xSemaphoreGiveFromISR(dev->qspi->state->dma_semaphore, &woken);
    portYIELD_FROM_ISR(woken);
  }
}

void qspi_flash_init(QSPIFlash *dev, QSPIFlashPart *part, bool coredump_mode) {
  static int was_init = 0;

  dev->state->part = part;
  dev->state->coredump_mode = coredump_mode;

  // Init the DMA semaphore, used for I/O ops
  if (!coredump_mode)
    dev->qspi->state->dma_semaphore = xSemaphoreCreateBinary();
  dev->qspi->state->waiting = 0;
  
  nrfx_qspi_config_t config = NRFX_QSPI_DEFAULT_CONFIG(
    dev->qspi->clk_gpio, dev->qspi->cs_gpio, dev->qspi->data_gpio[0],
    dev->qspi->data_gpio[1], dev->qspi->data_gpio[2], dev->qspi->data_gpio[3]);
  config.phy_if.sck_freq = NRF_QSPI_FREQ_32MDIV1;
  config.prot_if.readoc = NRF_QSPI_READOC_FASTREAD; /* XXX: later: use QSPI mode */
  config.prot_if.writeoc = NRF_QSPI_WRITEOC_PP;
  config.prot_if.addrmode = NRF_QSPI_ADDRMODE_24BIT;

  nrfx_err_t err;
  if (was_init) {
    nrfx_qspi_uninit();
  }
  err = nrfx_qspi_init(&config, coredump_mode ? NULL : _flash_handler, (void *)dev);
  PBL_ASSERTN(err == NRFX_SUCCESS);
  was_init = 1;
  
  prv_use(dev->qspi);

  if (dev->reset_gpio.gpio) {
    WTF;
  }

  // we do not enter QPI mode on nRF5
  // Reset the flash to stop any program's or erase in progress from before reboot
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.reset_enable);
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.reset);

  if (coredump_mode) {
    delay_us(dev->state->part->reset_latency_ms * 1000);
  } else {
    psleep(dev->state->part->reset_latency_ms);
  }

  if (!coredump_mode) {
    prv_check_whoami(dev);
  }

  if (0) {
    dev->state->coredump_mode = 1;
    nrfx_err_t err;
    uint8_t buf[16];
    PBL_LOG(LOG_LEVEL_WARNING, "erase...");
    dev->qspi->state->waiting = 1;
    err = nrfx_qspi_erase(NRF_QSPI_ERASE_LEN_ALL, 0);
    PBL_ASSERTN(err == NRFX_SUCCESS);
    while (dev->qspi->state->waiting);

    PBL_LOG(LOG_LEVEL_WARNING, "wait done...");
    while (nrfx_qspi_mem_busy_check() != NRFX_SUCCESS);

    PBL_LOG(LOG_LEVEL_WARNING, "readback..");
    dev->qspi->state->waiting = 1;
    err = nrfx_qspi_read(buf, 16, 0);
    PBL_ASSERTN(err == NRFX_SUCCESS);
    while (dev->qspi->state->waiting);
    PBL_LOG(LOG_LEVEL_WARNING, "new data: %02x %02x %02x %02x %02x %02x %02x %02x",
        buf[0], buf[1], buf[2], buf[3], buf[4], buf[5], buf[6], buf[7]);

    dev->state->coredump_mode = 0;
  }

  prv_release(dev->qspi);
}

status_t qspi_flash_is_erase_complete(QSPIFlash *dev) {
  prv_use(dev->qspi);

  uint8_t status_reg;
  uint8_t flag_status_reg;
  prv_read_register(dev->qspi, dev->state->part->instructions.read_status, &status_reg, 1);
  prv_read_register(dev->qspi, dev->state->part->instructions.read_flag_status, &flag_status_reg, 1);

  prv_release(dev->qspi);

  if (status_reg & dev->state->part->status_bit_masks.busy) {
    return E_BUSY;
  } else if (flag_status_reg & dev->state->part->flag_status_bit_masks.erase_suspend) {
    return E_AGAIN;
  } else {
    return S_SUCCESS;
  }
}

status_t qspi_flash_erase_begin(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  prv_use(dev->qspi);
  prv_write_enable(dev);

