w200024212/pebbleos/src/fw/drivers/nrf5/qspi.c
  dev->qspi->state->waiting = 1;
  
  nrfx_err_t err = nrfx_qspi_erase(is_subsector ? NRF_QSPI_ERASE_LEN_4KB : NRF_QSPI_ERASE_LEN_64KB, addr);
  PBL_ASSERTN(err == NRFX_SUCCESS);

  if (!dev->state->coredump_mode) {
    xSemaphoreTake(dev->qspi->state->dma_semaphore, portMAX_DELAY);
    PBL_ASSERTN(!dev->qspi->state->waiting);
  } else {
    dev->qspi->state->waiting = 0;
  }

  // wait for busy to be set indicating the erase has started
  const uint32_t busy_timeout_us = 500;
  const bool result = prv_poll_bit(dev->qspi, dev->state->part->instructions.read_status,
                                    dev->state->part->status_bit_masks.busy, true /* set */,
                                    busy_timeout_us);
  prv_release(dev->qspi);

  return result ? S_SUCCESS : E_ERROR;
}

status_t qspi_flash_erase_suspend(QSPIFlash *dev, uint32_t addr) {
  prv_use(dev->qspi);

  uint8_t status_reg;
  prv_read_register(dev->qspi, dev->state->part->instructions.read_status, &status_reg, 1);
  if (!(status_reg & dev->state->part->status_bit_masks.busy)) {
    // no erase in progress
    prv_release(dev->qspi);
    return S_NO_ACTION_REQUIRED;
  }

  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.erase_suspend);

  prv_release(dev->qspi);

  if (dev->state->part->suspend_to_read_latency_us) {
    delay_us(dev->state->part->suspend_to_read_latency_us);
  }

  return S_SUCCESS;
}

void qspi_flash_erase_resume(QSPIFlash *dev, uint32_t addr) {
  prv_use(dev->qspi);
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.erase_resume);
  // wait for the erase_suspend bit to be cleared
  prv_poll_bit(dev->qspi, dev->state->part->instructions.read_flag_status,
                dev->state->part->flag_status_bit_masks.erase_suspend, false /* !set */,
                QSPI_NO_TIMEOUT);
  prv_release(dev->qspi);
}

#if 0
static void prv_read_mmap_with_params(QSPIFlash *dev, uint32_t addr, void *buffer, uint32_t length,
                                      uint8_t instruction, uint8_t dummy_cycles, bool is_ddr) {
  qspi_mmap_start(dev->qspi, instruction, addr, dummy_cycles, length, is_ddr);

  // Point the buffer at the QSPI region
  memcpy(buffer, (uint32_t *)(QSPI_MMAP_BASE_ADDRESS + addr), length);

  // stop memory mapped mode
  qspi_mmap_stop(dev->qspi);
}

static void prv_read_mmap(QSPIFlash *dev, uint32_t addr, void *buffer, uint32_t length) {
  uint8_t instruction;
  uint8_t dummy_cycles;
  bool is_ddr;
  prv_get_fast_read_params(dev, &instruction, &dummy_cycles, &is_ddr);

  prv_read_mmap_with_params(dev, addr, buffer, length, instruction,
                            dummy_cycles, is_ddr);
}
#endif

static void prv_qspi_flash_read_blocking(QSPIFlash *dev, uint32_t addr, void *buffer, uint32_t length) {
  PBL_ASSERTN(!dev->qspi->state->waiting);
  dev->qspi->state->waiting = 1;
  
  nrfx_err_t err = nrfx_qspi_read(buffer, length, addr);
  PBL_ASSERTN(err == NRFX_SUCCESS);

  // XXX: later: use mmap?
  if (!dev->state->coredump_mode) {
    xSemaphoreTake(dev->qspi->state->dma_semaphore, portMAX_DELAY);
    PBL_ASSERTN(!dev->qspi->state->waiting);
  } else {
    dev->qspi->state->waiting = 0;
  }

  //uint8_t *buf = (uint8_t *)buffer;
  //PBL_LOG(LOG_LEVEL_WARNING, "... read %ld @ %08lx -> %02x %02x %02x %02x...", length, addr, buf[0], buf[1], buf[2], buf[3]);
}

void qspi_flash_read_blocking(QSPIFlash *dev, uint32_t addr, void *buffer, uint32_t length) {
  prv_use(dev->qspi);

  uint32_t buf_p = (uint32_t) buffer;
  if (buf_p & 3) {
    /* argh ... */
    uint32_t align_len = 4 - (buf_p & 3);
    uint32_t tbuf = 0xAAAAAAAA;
    if (align_len > length) {
      align_len = length;
    }

    prv_qspi_flash_read_blocking(dev, addr, &tbuf, 4);
    memcpy(buffer, &tbuf, align_len);
    length -= align_len;
    addr += align_len;
    buffer = ((uint8_t *)buffer) + align_len;
  }
  uint32_t tail_len = length & 3;
  length -= tail_len;
  if (length) {
    prv_qspi_flash_read_blocking(dev, addr, buffer, length);
    addr += length;
    buffer = ((uint8_t *)buffer) + length;
  }
  if (tail_len) {
    /* argh... */
    uint32_t tbuf = 0xAAAAAAAA;
    prv_qspi_flash_read_blocking(dev, addr, &tbuf, 4);
    memcpy(buffer, &tbuf, tail_len);
  }

  prv_release(dev->qspi);
}

static void prv_write_page_begin(QSPIFlash *dev, const void *buffer, uint32_t addr,
                                uint32_t length) {
  PBL_ASSERTN(((uint32_t)buffer & 3) == 0);
  PBL_ASSERTN(((uint32_t)buffer & 0xF0000000) == 0x20000000);
  PBL_ASSERTN(length > 0);

  prv_write_enable(dev);

  PBL_ASSERTN(!dev->qspi->state->waiting);
  dev->qspi->state->waiting = 1;

  nrfx_err_t err = nrfx_qspi_write(buffer, length, addr); 
  PBL_ASSERTN(err == NRFX_SUCCESS);

  if (!dev->state->coredump_mode) {
    xSemaphoreTake(dev->qspi->state->dma_semaphore, portMAX_DELAY);
    PBL_ASSERTN(!dev->qspi->state->waiting);
  } else {
    dev->qspi->state->waiting = 0;
  }

  prv_poll_bit(dev->qspi, dev->state->part->instructions.read_status,
                dev->state->part->status_bit_masks.busy, false /* !set */, QSPI_NO_TIMEOUT);
}

static uint8_t s_qspi_ram_buffer[32];
int qspi_flash_write_page_begin(QSPIFlash *dev, const void *buffer, uint32_t addr,
                                uint32_t length) {
  const uint32_t offset_in_page = addr % PAGE_SIZE_BYTES;
  uint32_t bytes_in_page = MIN(PAGE_SIZE_BYTES - offset_in_page, length);
  
  if (((uintptr_t) buffer & 0xF0000000) != 0x20000000) {
    /* we cannot DMA from non-RAM, so bounce through a RAM buffer if we have
     * to; this is not performant but it is ok because any time we are
     * writing to QSPI flash from internal flash, it is during
     * initialization and should be pretty infrequent 
     */
    bytes_in_page = MIN(bytes_in_page, sizeof(s_qspi_ram_buffer));
    memcpy(s_qspi_ram_buffer, buffer, bytes_in_page);
    buffer = s_qspi_ram_buffer;
    /* s_qspi_ram_buffer does not get overwritten because nobody will call
     * us again until qspi_flash_get_write_status completes
     */
  }
  
  length = bytes_in_page;
  
  prv_use(dev->qspi);

