w200024212/pebbleos/src/fw/drivers/nrf5/qspi.c
  prv_write_enable(dev);

  uint32_t buf_p = (uint32_t) buffer;
  if (buf_p & 3) {
    /* argh ... */
    uint32_t align_len = 4 - (buf_p & 3);
    uint32_t tbuf = 0xFFFFFFFF;
    if (align_len > length) {
      align_len = length;
    }

    memcpy(&tbuf, buffer, align_len);
    prv_write_page_begin(dev, &tbuf, addr, 4);
    length -= align_len;
    addr += align_len;
    buffer = ((uint8_t *)buffer) + align_len;

    while (nrfx_qspi_mem_busy_check() != NRFX_SUCCESS)
      delay_us(10);
  }

  uint32_t tail_len = length & 3;
  length -= tail_len;
  if (length) {
    prv_write_page_begin(dev, buffer, addr, length);
    addr += length;
    buffer = ((uint8_t *)buffer) + length;
  }

  if (tail_len) {
    /* argh... */
    while (nrfx_qspi_mem_busy_check() != NRFX_SUCCESS)
      delay_us(10);

    uint32_t tbuf = 0xFFFFFFFF;
    memcpy(&tbuf, buffer, tail_len);
    prv_write_page_begin(dev, &tbuf, addr, 4);
  }

  prv_release(dev->qspi);

  return bytes_in_page;
}

status_t qspi_flash_get_write_status(QSPIFlash *dev) {
  prv_use(dev->qspi);
  uint8_t status_reg;
  prv_read_register(dev->qspi, dev->state->part->instructions.read_status, &status_reg, 1);
  prv_release(dev->qspi);
  return (status_reg & dev->state->part->status_bit_masks.busy) ? E_BUSY : S_SUCCESS;
}

void qspi_flash_set_lower_power_mode(QSPIFlash *dev, bool active) {
  prv_use(dev->qspi);
  uint8_t instruction;
  uint32_t delay;
  if (active) {
    instruction = dev->state->part->instructions.enter_low_power;
    delay = dev->state->part->standby_to_low_power_latency_us;
  } else {
    instruction = dev->state->part->instructions.exit_low_power;
    delay = dev->state->part->low_power_to_standby_latency_us;
  }
  prv_write_cmd_no_addr(dev->qspi, instruction);
  prv_release(dev->qspi);
  if (delay) {
    delay_us(delay);
  }
}

#if 1
// While this works with normal hardware, it has a large stack requirment and I can't
// see a compelling reason to use it over the mmap blank check variant
static bool prv_blank_check_poll(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  const uint32_t size_bytes = is_subsector ? SUBSECTOR_SIZE_BYTES : SECTOR_SIZE_BYTES;
  const uint32_t BUF_SIZE_BYTES = 128;
  const uint32_t BUF_SIZE_WORDS = BUF_SIZE_BYTES / sizeof(uint32_t);
  uint32_t buffer[BUF_SIZE_WORDS];
  for (uint32_t offset = 0; offset < size_bytes; offset += BUF_SIZE_BYTES) {
    flash_impl_read_sync(buffer, addr + offset, BUF_SIZE_BYTES);
    for (uint32_t i = 0; i < BUF_SIZE_WORDS; ++i) {
      if (buffer[i] != FLASH_RESET_WORD_VALUE) {
        return false;
      }
    }
  }
  return true;
}
#else

static bool prv_blank_check_mmap(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  const uint32_t size_bytes = is_subsector ? SUBSECTOR_SIZE_BYTES : SECTOR_SIZE_BYTES;
  bool result = true;
  uint8_t instruction;
  uint8_t dummy_cycles;
  bool is_ddr;
  prv_get_fast_read_params(dev, &instruction, &dummy_cycles, &is_ddr);
  qspi_mmap_start(dev->qspi, instruction, addr, dummy_cycles, size_bytes, is_ddr);

  // Point the buffer at the QSPI region
  uint32_t const volatile * const buffer = (uint32_t *)(QSPI_MMAP_BASE_ADDRESS + addr);
  uint32_t size_words = size_bytes / sizeof(uint32_t);
  for (uint32_t i = 0; i < size_words; ++i) {
    if (buffer[i] != FLASH_RESET_WORD_VALUE) {
      result = false;
      break;
    }
  }

  // stop memory mapped mode
  qspi_mmap_stop(dev->qspi);
  return result;
}
#endif

status_t qspi_flash_blank_check(QSPIFlash *dev, uint32_t addr, bool is_subsector) {
  prv_use(dev->qspi);
#if 1
  const bool result = prv_blank_check_poll(dev, addr, is_subsector);
#else
  const bool result = prv_blank_check_mmap(dev, addr, is_subsector);
#endif
  prv_release(dev->qspi);
  return result ? S_TRUE : S_FALSE;
}

void qspi_flash_ll_set_register_bits(QSPIFlash *dev, uint8_t read_instruction,
                                     uint8_t write_instruction, uint8_t value, uint8_t mask) {
  // make sure we're not trying to set any bits not within the mask
  PBL_ASSERTN((value & mask) == value);

  prv_use(dev->qspi);

  // first read the register
  uint8_t reg_value;
  prv_read_register(dev->qspi, read_instruction, &reg_value, 1);

  // set the desired bits
  reg_value = (reg_value & ~mask) | value;

  // enable writing and write the register value
  prv_write_cmd_no_addr(dev->qspi, dev->state->part->instructions.write_enable);
  qspi_indirect_write_no_addr(dev->qspi, write_instruction, &reg_value, 1);

  prv_release(dev->qspi);
}

status_t qspi_flash_write_protection_enable(QSPIFlash *dev) {
  return S_NO_ACTION_REQUIRED;
}

status_t qspi_flash_lock_sector(QSPIFlash *dev, uint32_t addr) {
  return S_SUCCESS;
}

status_t qspi_flash_unlock_all(QSPIFlash *dev) {
  return S_SUCCESS;
}

#if !RELEASE
#include "console/prompt.h"
#include "drivers/flash.h"
#include "kernel/pbl_malloc.h"
#include "system/profiler.h"
#include "util/size.h"

static bool prv_flash_read_verify(QSPIFlash *dev, int size, int offset) {
  bool success = true;

  profiler_start();
  // prv_read_mmap(dev, 0, buffer_mmap, size);
  profiler_stop();
  uint32_t mmap_time = profiler_get_total_duration(true);

  const int buf_size = 64;
  char buf[buf_size];
  prompt_send_response_fmt(buf, buf_size, "Size: %d UNIMPL: MMP: %"PRIu32,
                           size, mmap_time);


  return success;
}

struct FlashReadTestValues {
  int size;
  int offset;
};

const struct FlashReadTestValues FLASH_READ_TEST_TABLE[] = {
  { .size = 1024, .offset = 0 },
  { .size = 1025, .offset = 0 },
  { .size = 1026, .offset = 0 },
  { .size = 1027, .offset = 0 },
  { .size = 1024, .offset = 1 },
  { .size = 1025, .offset = 2 },
  { .size = 1026, .offset = 3 },
  { .size = 4,    .offset = 0 },
  { .size = 20,   .offset = 0 },
  { .size = 60,   .offset = 0 },
  { .size = 127,  .offset = 0 },
  { .size = 128,  .offset = 0 },
};


void command_flash_apicheck(const char *len_str) {
  QSPIFlash *dev = QSPI_FLASH;
  const int buf_size = 64;
  char buf[buf_size];
  int failures = 0;
  int passes = 0;

  profiler_init();

  prompt_send_response("Check whoami");
  if (!qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Enter low power mode");
  flash_impl_enter_low_power_mode();

  // WHOAMI should fail in low-power mode
  prompt_send_response("Check whoami, should fail in low power mode");
  if (qspi_flash_check_whoami(dev)) {
    ++failures;
    prompt_send_response("ERROR: Who am I failed");
  } else {
    ++passes;
  }

  prompt_send_response("Exit low power mode");
  flash_impl_exit_low_power_mode();

  prompt_send_response("Start flash_read_verify test");
  prv_use(dev->qspi);

  const int final_size = atoi(len_str);

